avr-rust/avrd/packs/xmegad/ATxmega128D3.atdf
          </instance>
          <instance name="TCD0">
            <register-group address-space="data" offset="0x900" name-in-module="TC0" name="TCD0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PD0"/>
              <signal function="TC0" group="OC0B" pad="PD1"/>
              <signal function="TC0" group="OC0C" pad="PD2"/>
              <signal function="TC0" group="OC0D" pad="PD3"/>
            </signals>
          </instance>
          <instance name="TCE0">
            <register-group address-space="data" offset="0xA00" name-in-module="TC0" name="TCE0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PE0"/>
              <signal function="TC0" group="OC0B" pad="PE1"/>
              <signal function="TC0" group="OC0C" pad="PE2"/>
              <signal function="TC0" group="OC0D" pad="PE3"/>
            </signals>
          </instance>
          <instance name="AWEXE">
            <register-group address-space="data" offset="0xA80" name-in-module="AWEX" name="AWEXE"/>
          </instance>
          <instance name="TCF0">
            <register-group address-space="data" offset="0xB00" name-in-module="TC0" name="TCF0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PF0"/>
              <signal function="TC0" group="OC0B" pad="PF1"/>
              <signal function="TC0" group="OC0C" pad="PF2"/>
              <signal function="TC0" group="OC0D" pad="PF3"/>
            </signals>
          </instance>
        </module>
        <module name="USART" id="I6090">
          <instance name="USARTC0">
            <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PC1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PC2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PC3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PC5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PC6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PC7"/>
            </signals>
          </instance>
          <instance name="USARTD0">
            <register-group address-space="data" offset="0x9A0" name-in-module="USART" name="USARTD0"/>
            <signals>
              <signal function="USART" group="XCK" pad="PD1"/>
              <signal function="USART" group="RXD" pad="PD2"/>
              <signal function="USART" group="TXD" pad="PD3"/>
            </signals>
          </instance>
          <instance name="USARTE0">
            <register-group address-space="data" offset="0xAA0" name-in-module="USART" name="USARTE0"/>
            <signals>
              <signal function="USART" group="XCK" pad="PE1"/>
              <signal function="USART" group="RXD" pad="PE2"/>
              <signal function="USART" group="TXD" pad="PE3"/>
            </signals>
          </instance>
        </module>
        <module name="SPI" id="I6090">
          <instance name="SPIC">
            <register-group address-space="data" offset="0x8C0" name-in-module="SPI" name="SPIC"/>
            <signals>
              <signal field="SPI" function="SPI" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI" group="MOSI" pad="PC5"/>
              <signal field="SPI" function="SPI" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI" group="SCK" pad="PC7"/>
              <signal field="SPI" function="SPI_ALT" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI_ALT" group="SCK" pad="PC5"/>
              <signal field="SPI" function="SPI_ALT" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI_ALT" group="MOSI" pad="PC7"/>
            </signals>
          </instance>
          <instance name="SPID">
            <register-group address-space="data" offset="0x9C0" name-in-module="SPI" name="SPID"/>
            <signals>
              <signal function="SPI" group="SS" pad="PD4"/>
              <signal function="SPI" group="MOSI" pad="PD5"/>
              <signal function="SPI" group="MISO" pad="PD6"/>
              <signal function="SPI" group="SCK" pad="PD7"/>
            </signals>
          </instance>
          <instance name="SPIE">
            <register-group address-space="data" offset="0xAC0" name-in-module="SPI" name="SPIE"/>
          </instance>
        </module>
        <module name="IRCOM" id="I6090">
          <instance name="IRCOM">
            <register-group address-space="data" offset="0x8F8" name-in-module="IRCOM" name="IRCOM"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt-group index="1" module-instance="OSC" name-in-module="OSC"/>
        <interrupt-group index="2" module-instance="PORTC" name-in-module="PORT"/>
        <interrupt-group index="4" module-instance="PORTR" name-in-module="PORT"/>
        <interrupt-group index="10" module-instance="RTC" name-in-module="RTC"/>
        <interrupt-group index="12" module-instance="TWIC" name-in-module="TWI"/>
        <interrupt-group index="14" module-instance="TCC0" name-in-module="TC0"/>
        <interrupt-group index="20" module-instance="TCC1" name-in-module="TC1"/>
        <interrupt-group index="24" module-instance="SPIC" name-in-module="SPI"/>
        <interrupt-group index="25" module-instance="USARTC0" name-in-module="USART"/>
        <interrupt-group index="32" module-instance="NVM" name-in-module="NVM"/>
        <interrupt-group index="34" module-instance="PORTB" name-in-module="PORT"/>
        <interrupt-group index="43" module-instance="PORTE" name-in-module="PORT"/>
        <interrupt-group index="45" module-instance="TWIE" name-in-module="TWI"/>
        <interrupt-group index="47" module-instance="TCE0" name-in-module="TC0"/>
        <interrupt-group index="58" module-instance="USARTE0" name-in-module="USART"/>
        <interrupt-group index="64" module-instance="PORTD" name-in-module="PORT"/>
        <interrupt-group index="66" module-instance="PORTA" name-in-module="PORT"/>
        <interrupt-group index="68" module-instance="ACA" name-in-module="AC"/>
        <interrupt-group index="71" module-instance="ADCA" name-in-module="ADC"/>
        <interrupt-group index="77" module-instance="TCD0" name-in-module="TC0"/>
        <interrupt-group index="87" module-instance="SPID" name-in-module="SPI"/>
        <interrupt-group index="88" module-instance="USARTD0" name-in-module="USART"/>
        <interrupt-group index="104" module-instance="PORTF" name-in-module="PORT"/>
        <interrupt-group index="108" module-instance="TCF0" name-in-module="TC0"/>
      </interrupts>
      <interfaces>
        <interface type="pdi" name="PDI"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x0974803F"/>
          <property name="SIGNATURE0" value="0x1E"/>
          <property name="SIGNATURE1" value="0x97"/>
          <property name="SIGNATURE2" value="0x48"/>
        </property-group>
        <property-group name="PDI_INTERFACE">
          <property name="APP_SECTION_OFFSET" value="0x00800000"/>
          <property name="APPTABLE_SECTION_OFFSET" value="0x0081E000"/>
          <property name="BOOT_SECTION_OFFSET" value="0x00820000"/>
          <property name="DATAMEM_OFFSET" value="0x01000000"/>
          <property name="EEPROM_OFFSET" value="0x008C0000"/>
          <property name="USER_SIGNATURES_OFFSET" value="0x008E0400"/>
          <property name="PROD_SIGNATURES_OFFSET" value="0x008E0200"/>
          <property name="FUSE_REGISTERS_OFFSET" value="0x008F0020"/>
          <property name="LOCK_REGISTERS_OFFSET" value="0x008F0027"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="GPIO" id="I6085" version="XMEGAD" caption="General Purpose IO">
      <register-group caption="General Purpose IO Registers" name="GPIO" size="4">
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x00" size="1"/>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x01" size="1"/>
